# task10.py

# x = int(input("Введите число: "))
# if x % 2 == 0:
#          print(("Четное"))
#
# else:
#          print(("Нечетное"))

# # task5.py
#
# a = int(input("Введите число A: "))
# b = int(input("Введите число B: "))
# s = a + b
# print(('Сумма равна:'),s)
#
# s = a - b
# print(('Разность равна:'),s)
#
# s = a // b
# print(('Частное равно:'),s)
#
# s = a * b
# print(('Произведение равно:'),s)
#
# s = a % b
# print(('Результат целочисленного деления равен:'),s)
#
# s = a ** b
# print(('Результат возведения в степень равен:'),s)

# # task6.py
#
# a = int(input("Введите число: "))
# s = a **2
# print(('Площадь равна:'),s)

# task7.py

# a = int(input("Введите число А: "))
# b = int(input("Введите число B: "))
# c = int(input("Введите число C: "))
# s = b - a
# print(('Сторона АВ равна:'),s)
# e = c - b
# print(('Сторона ВС равна:'),e)
# r = e + s
# print(('Сумма сторон равна:'),r)
test
git